{"results":[{"idMeal":"52830","title":"Crock Pot Chicken Baked Tacos","strDrinkAlternate":null,"strCategory":"Chicken","strArea":"Mexican","strInstructions":"Put the uncooked chicken breasts in the crock pot. Pour the full bottle of salad dressing over the chicken. Sprinkle the rest of the ingredients over the top and mix them in a bit with a spoon. Cover your crock pot with the lid and cook on high for 4 hours. Remove all the chicken breasts from the crock pot and let cool. Shred the chicken breasts and move to a glass bowl. Pour most of the liquid over the shredded chicken. FOR THE TACOS: Make the guacamole sauce by mixing the avocado and green salsa together. Pour the guacamole mixture through a strainer until smooth and transfer to a squeeze bottle. Cut the tip off the lid of the squeeze bottle to make the opening more wide if needed. Make the sour cream sauce by mixing the sour cream and milk together until you get a more liquid sour cream sauce. Transfer to a squeeze bottle. In a 9x 13 glass baking dish, fill all 12+ tacos with a layer of refried beans, cooked chicken and shredded cheese. Bake at 450 for 10-15 minutes just until the cheese is melted and bubbling. Out of the oven top all the tacos with the sliced grape tomaotes, jalapeno and cilantro. Finish with a drizzle of guacamole and sour cream. Enjoy!","thumbnail":"https://www.themealdb.com/images/media/meals/ypxvwv1505333929.jpg","strTags":null,"href":"https://www.youtube.com/watch?v=oqL0mLDBzS4","ingredients":["Chicken Breasts","Vinaigrette Dressing","Cumin","Smoked Paprika","Garlic","Refried Beans","Hard Taco Shells","Shredded Mexican Cheese","Grape Tomatoes","Jalapeno","Avocado","Green Salsa","Sour Cream","Milk"]},{"idMeal":"52765","title":"Chicken Enchilada Casserole","strDrinkAlternate":null,"strCategory":"Chicken","strArea":"Mexican","strInstructions":"Cut each chicken breast in about 3 pieces, so that it cooks faster and put it in a small pot. Pour Enchilada sauce over it and cook covered on low to medium heat until chicken is cooked through, about 20 minutes. No water is needed, the chicken will cook in the Enchilada sauce. Make sure you stir occasionally so that it doesn't stick to the bottom. Remove chicken from the pot and shred with two forks. Preheat oven to 375 F degrees. Start layering the casserole. Start with about ¼ cup of the leftover Enchilada sauce over the bottom of a baking dish. I used a longer baking dish, so that I can put 2 corn tortillas across. Place 2 tortillas on the bottom, top with ⅓ of the chicken and ⅓ of the remaining sauce. Sprinkle with ⅓ of the cheese and repeat starting with 2 more tortillas, then chicken, sauce, cheese. Repeat with last layer with the remaining ingredients, tortillas, chicken, sauce and cheese. Bake for 20 to 30 minutes uncovered, until bubbly and cheese has melted and started to brown on top. Serve warm.","thumbnail":"https://www.themealdb.com/images/media/meals/qtuwxu1468233098.jpg","strTags":"Casserole,Cheasy,Meat","href":"https://www.youtube.com/watch?v=EtVkwVKLc_M","ingredients":["Enchilada sauce","shredded Monterey Jack cheese","corn tortillas","chicken breasts"]},{"idMeal":"52858","title":"New York cheesecake","strDrinkAlternate":null,"strCategory":"Dessert","strArea":"American","strInstructions":"Position an oven shelf in the middle of the oven. Preheat the oven to fan 160C/conventional 180C/gas 4. Line the base of a 23cm springform cake tin with parchment paper. For the crust, melt the butter in a medium pan. Stir in the biscuit crumbs and sugar so the mixture is evenly moistened. Press the mixture into the bottom of the pan and bake for 10 minutes. Cool on a wire rack while preparing the filling. For the filling, increase the oven temperature to fan 200C/conventional 240C/gas 9. In a table top mixer fitted with the paddle attachment, beat the soft cheese at medium-low speed until creamy, about 2 minutes. With the mixer on low, gradually add the sugar, then the flour and a pinch of salt, scraping down the sides of the bowl and the paddle twice. Swap the paddle attachment for the whisk. Continue by adding the vanilla, lemon zest and juice. Whisk in the eggs and yolk, one at a time, scraping the bowl and whisk at least twice. Stir the 284ml carton of soured cream until smooth, then measure 200ml/7fl oz (just over 3⁄4 of the carton). Continue on low speed as you add the measured soured cream (reserve the rest). Whisk to blend, but don't over-beat. The batter should be smooth, light and somewhat airy. Brush the sides of the springform tin with melted butter and put on a baking sheet. Pour in the filling - if there are any lumps, sink them using a knife - the top should be as smooth as possible. Bake for 10 minutes. Reduce oven temperature to fan 90C/conventional 110C/gas 1⁄4 and bake for 25 minutes more. If you gently shake the tin, the filling should have a slight wobble. Turn off the oven and open the oven door for a cheesecake that's creamy in the centre, or leave it closed if you prefer a drier texture. Let cool in the oven for 2 hours. The cheesecake may get a slight crack on top as it cools. Combine the reserved soured cream with the 142ml carton, the sugar and lemon juice for the topping. Spread over the cheesecake right to the edges. Cover loosely with foil and refrigerate for at least 8 hours or overnight. Run a round-bladed knife around the sides of the tin to loosen any stuck edges. Unlock the side, slide the cheesecake off the bottom of the tin onto a plate, then slide the parchment paper out from underneath.","thumbnail":"https://www.themealdb.com/images/media/meals/swttys1511385853.jpg","strTags":"Desert,Dairy,Pudding,Cake,Breakfast","href":"https://www.youtube.com/watch?v=tspdJ6hxqnc","ingredients":["Butter","Sour Cream","Sugar","Cream Cheese","Caster Sugar","Plain Flour","Lemon Juice","Eggs","Sour Cream","Sour Cream","Caster Sugar","Lemon Juice"]},{"idMeal":"52818","title":"Chicken Fajita Mac and Cheese","strDrinkAlternate":null,"strCategory":"Chicken","strArea":"American","strInstructions":"Fry your onion, peppers and garlic in olive oil until nicely translucent. Make a well in your veg and add your chicken. Add your seasoning and salt. Allow to colour slightly. Add your cream, stock and macaroni. Cook on low for 20 minutes. Add your cheeses, stir to combine. Top with roasted peppers and parsley.","thumbnail":"https://www.themealdb.com/images/media/meals/qrqywr1503066605.jpg","strTags":"Pasta,Cheasy,Meat","href":"https://www.youtube.com/watch?v=bwTSmLTZKNg","ingredients":["macaroni","chicken stock","heavy cream","fajita seasoning","salt","chicken breast","olive oil","onion","red pepper","garlic","cheddar cheese","parsley"]},{"idMeal":"52856","title":"Choc Chip Pecan Pie","strDrinkAlternate":null,"strCategory":"Dessert","strArea":"American","strInstructions":"First, make the pastry. Tip the ingredients into a food processor with 1 /4 tsp salt. Blend until the mixture resembles breadcrumbs. Drizzle 2-3 tsp cold water into the funnel while the blade is running – the mixture should start to clump together. Tip onto a work surface and bring together, kneading briefly into a ball. Pat into a disc, wrap in cling film, and chill for at least 20 mins. Heat oven to 200C/180C fan/gas 6. Remove the pastry from the fridge and leave at room temperature for 5 mins to soften. Flour the work surface, then unwrap the pastry and roll to a circle the thickness of a £1 coin. Use the pastry to line a deep, 23cm round fluted tin – mine was about 3cm deep. Press the pastry into the corners and up the sides, making sure there are no gaps. Leave 1cm pastry overhanging (save some of the pastry scraps for later). Line with baking parchment (scrunch it up first to make it more pliable) and fill with baking beans. Blind-bake for 15-20 mins until the sides are set, then remove the parchment and beans and return to the oven for 5 mins until golden brown. Trim the pastry so it’s flush with the top of the tin – a small serrated knife is best for this. If there are any cracks, patch them up with the pastry scraps. Meanwhile, weigh the butter, syrup and sugars into a pan, and add 1 /4 tsp salt. Heat until the butter has melted and the sugar dissolved, stirring until smooth. Remove from the heat and cool for 10 mins. Reduce oven to 160C/140C fan/gas 3. Beat the eggs in a bowl. Add the syrup mixture, vanilla and pecans, and mix until well combined. Pour half the mixture into the tart case, scatter over half the chocolate chips, then cover with the remaining filling and chocolate chips. Bake on the middle shelf for 50-55 mins until set. Remove from the oven and leave to cool, then chill for at least 2 hrs before serving.","thumbnail":"https://www.themealdb.com/images/media/meals/rqvwxt1511384809.jpg","strTags":"Pie,Desert,Sweet,Nutty","href":"https://www.youtube.com/watch?v=fDpoT0jvg4Y","ingredients":["Plain Flour","Butter","Cream Cheese","Icing Sugar","Butter","Maple Syrup","Light Brown Soft Sugar","Dark Brown Soft Sugar","Eggs","Vanilla Extract","Pecan Nuts","Dark Chocolate Chips"]},{"idMeal":"52897","title":"Carrot Cake","strDrinkAlternate":null,"strCategory":"Dessert","strArea":"British","strInstructions":"For the carrot cake, preheat the oven to 160C/325F/Gas 3. Grease and line a 26cm/10in springform cake tin. Mix all of the ingredients for the carrot cake, except the carrots and walnuts, together in a bowl until well combined. Stir in the carrots and walnuts. Spoon the mixture into the cake tin and bake for 1 hour 15 minutes, or until a skewer inserted into the middle comes out clean. Remove the cake from the oven and set aside to cool for 10 minutes, then carefully remove the cake from the tin and set aside to cool completely on a cooling rack. Meanwhile, for the icing, beat the cream cheese, caster sugar and butter together in a bowl until fluffy. Spread the icing over the top of the cake with a palette knife.","thumbnail":"https://www.themealdb.com/images/media/meals/vrspxv1511722107.jpg","strTags":"Cake,Treat,Sweet","href":"https://www.youtube.com/watch?v=asjZ7iTrGKA","ingredients":["Vegetable Oil","Plain Flour","Bicarbonate Of Soda","Sugar","Eggs","Salt","Cinnamon","Carrots","Walnuts","Cream Cheese","Caster Sugar","Butter"]}]}